# Задание 14
## №1

Сколько единиц содержится в двоичной записи значения выражения: 4<sup>2020</sup> + 2<sup>2017</sup> – 15 ?

```
x = 4**2020 + 2**2017 - 15
k = 0
while x > 0:
&nbsp;&nbsp;if x % 2 == 1:
&nbsp;&nbsp;&nbsp;&nbsp;k += 1
&nbsp;&nbsp;&nbsp;&nbsp;x = x // 2
print(k)
```
<i>Где x - выражение, k - количество единиц</i>
> Output - 2015
