# Задание 14
## №1

Сколько единиц содержится в двоичной записи значения выражения: 4<sup>2020</sup> + 2<sup>2017</sup> – 15 ?

```
x = 4**2020 + 2**2017 - 15
k = 0
while x > 0:
    if x % 2 == 1:
        k += 1
    x = x // 2
print(k)
```
<i>Где x - выражение, k - количество единиц</i>
> Output - 2015

--------------------------------------------
## №2

Укажите наименьшее основание системы счисления, в которой запись числа 50 трехзначна.

Максимальное <b>трехзначное</b> число в <b>n-ичной</b> системе равно <b>n<sup>3</sup> − 1</b>. <br/>
Это число не меньше 50 <i>(по условию)</i>, а поэтому n не меньше 4. 
 > Следовательно, наименьшее n = 4.
