# Задание 17
## №1

В файле содержится последовательность целых чисел, которые принимают значения от -10000 до 10000 включительно. Тройка идущих подряд чисел последовательности называется уникальной, если только второе из них является положительным трёхзначным нечётным числом. Определите количество уникальных троек чисел, а затем – максимальную из всех сумм таких троек.

```python
f = open('17.txt')
nums = list(map(int, f.read().split()))
print(nums)
count = 0
max = -30000
for i in range(0, len(nums)-2):
    if (nums[i] <= 0 or len(str(nums[i])) != 3 or nums[i] % 2 == 0) and (nums[i + 1] > 0 and len(str(nums[i + 1])) == 3 and nums[i + 1] % 2 == 1) and (nums[i + 2] <= 0 or len(str(nums[i + 2])) != 3 or nums[i + 2] % 2 == 0):
        count+=1
        if nums[i] + nums[i+1] + nums[i+2] > max:
            max = nums[i] + nums[i+1] + nums[i+2]
print(count, max)
```
---------------------------------------------------------

## №2
В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает 10 000. Определите и запишите в ответе сначала количество пар элементов последовательности, для которых произведение элементов не кратно 34, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.

```python
with open('17_2.txt', 'r') as f: # берем файл
    nums = f.read().splitlines() # заносим строки в массив (одна стрка = 1 элемент)
nums = [int(item) for item in nums]
print(nums)

count = 0
max = 0
number = 0

for i in range(0, len(nums)):
    for j in range(number, len(nums)):
        if nums[i]*nums[j]%34!=0 and i != j:
            count+=1
            if nums[i]+nums[j] > max:
                max = nums[i]+nums[j]
    number+=1
print(count, max)
```
